performance.yml
config:
  target: "https://api.todoist.com"
  phases:
    - duration: 3
      arrivalRate: 1
      name: "Phase 1"
  defaults:
   headers:
     Authorization: Bearer {{ $processEnvironment.TOKEN }}
     Content-type: application/json
  ##processor: "./myprocessor.js"
scenarios:
    - flow:
        - get:
            url: "/rest/v1/tasks"
        - post:
            url: "/rest/v1/tasks"
            json:
              content: "NewTask"
              due_string: "tomorrow at 12:00"
              due_lang: "en"
              priority: 4
            capture:
              json: "$.id"
              as: "id"
        - log: "Current id is {{ id }}"
        - get:
            url: "/rest/v1/tasks/{{ id }}"
        - post:
            url: "/rest/v1/tasks/{{ id }}"
            json:
              content: "UpdatedTask"
        - post:
            url: "/rest/v1/tasks/{{ id }}/close"
        - post:
            url: "/rest/v1/tasks/{{ id }}/reopen"
        - delete:
            url: "/rest/v1/tasks/{{ id }}"